ws-asahi/UkiUkiCore/megaavr/boards.txt
# =====================================================================
#  WazamonoCore - boards.txt
#  Trimmed to the single product board "Wazamono Tachi" (AVR64DU32).
#  All other MCU/board families from DxCore are removed.
#  Derived from DxCore's avrduusb (USB-CDC bootloader) definition;
#  DxCore (C) Spence Konde, LGPL 2.1. Customizations (C) Workshop Asahi.
#
#  Test switch: the Clock menu lets you choose WITH external 24 MHz
#  crystal (production default) or WITHOUT it (internal OSCHF), so the
#  same board can be validated crystal-less.
# =====================================================================

menu.clock=Clock Speed

# =====================  Wazamono Tachi (AVR64DU32)  ==================
wazamonotachi.name=Wazamono Tachi (AVR64DU32)

wazamonotachi.upload.tool=avrdude
wazamonotachi.upload.prog_interlock=
wazamonotachi.vid.0=0x1209
wazamonotachi.pid.0=0x0006
wazamonotachi.vid.1=0x1209
wazamonotachi.pid.1=0x0005
wazamonotachi.build.board=avrdu
wazamonotachi.build.core=dxcore
wazamonotachi.build.f_cpu={build.speed}000000L
wazamonotachi.build.text_section_start=.text=0x1000
wazamonotachi.build.defaultswaps=
wazamonotachi.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_OPTIBOOT
wazamonotachi.build.export_merged_output=false
wazamonotachi.build.printf=
wazamonotachi.build.flmapopts=
wazamonotachi.build.attachmode=-DCORE_ATTACH_ALL
wazamonotachi.bootloader.tool=avrdude
wazamonotachi.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
wazamonotachi.bootloader.wdtwindowbits=0000
wazamonotachi.bootloader.BODCFG=0x00
wazamonotachi.bootloader.updipinbit=1
wazamonotachi.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
wazamonotachi.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
wazamonotachi.bootloader.CODESIZE=0x00
wazamonotachi.bootloader.BOOTSIZE=0x08
wazamonotachi.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
wazamonotachi.bootloader.wdttimeoutbits=0000
wazamonotachi.bootloader.eesavebit=1
wazamonotachi.bootloader.resetpinbit=1
wazamonotachi.bootloader.sutbits=100
# Compile-time options: millis=TCB0, Wire=Master-or-Slave(single) [.wO above].
#   attach=all-pins, FLMAP=unlocked, printf=default already come from the
#   board-level base values above, so menu removal keeps those defaults.
wazamonotachi.build.millistimer=B0
wazamonotachi.build.wiremode=MORS_SINGLE
wazamonotachi.bootloader.resetpinbits={bootloader.resetpinbit}
wazamonotachi.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotachi.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
wazamonotachi.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
wazamonotachi.bootloader.pymcuprogstring=-aerase
wazamonotachi.build.mcupostfix=
wazamonotachi.build.printfabr=
wazamonotachi.build.flmapabr=.ful
wazamonotachi.build.attachabr=
wazamonotachi.build.wireabr=.wO
wazamonotachi.build.appspmabr=
wazamonotachi.upload.protocol=arduino
wazamonotachi.upload.speed=115200
wazamonotachi.upload.extra_params=-D
wazamonotachi.upload.use_1200bps_touch=true
wazamonotachi.upload.wait_for_upload_port=true
wazamonotachi.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}.hex
wazamonotachi.bootloader.appspm=

# --- Clock: WITH 24 MHz crystal (default) or WITHOUT (internal OSCHF) ---
#  clocksource: 0 = internal OSCHF, 1 = external HF crystal (PA0/PA1),
#               2 = external clock (PA0 only). USB always uses the internal
#               PLL48M (SOF-tuned), independent of this choice.
wazamonotachi.menu.clock.24crystal=24 MHz external crystal (default)
wazamonotachi.menu.clock.24crystal.build.speed=24
wazamonotachi.menu.clock.24crystal.build.clocksource=1
wazamonotachi.menu.clock.24internal=24 MHz internal (no crystal)
wazamonotachi.menu.clock.24internal.build.speed=24
wazamonotachi.menu.clock.24internal.build.clocksource=0
wazamonotachi.menu.clock.20internal=20 MHz internal (no crystal)
wazamonotachi.menu.clock.20internal.build.speed=20
wazamonotachi.menu.clock.20internal.build.clocksource=0
wazamonotachi.menu.clock.16internal=16 MHz internal (no crystal)
wazamonotachi.menu.clock.16internal.build.speed=16
wazamonotachi.menu.clock.16internal.build.clocksource=0

# --- millis()/micros() timer. TCB0 is the default so TCB1 stays free for
#     D3 PWM and TCA0 stays free for D5-D10 PWM. ---

# --- Locked to AVR64DU32 (chip submenu removed). Variant + bootloader hex
#     fixed to Wazamono Tachi. ---
wazamonotachi.build.mcu=avr64du32
wazamonotachi.build.variant=WazamonoTachi
wazamonotachi.build.highestcb=B2
wazamonotachi.upload.maximum_size=61440
wazamonotachi.upload.maximum_data_size=8192
wazamonotachi.bootloader.class=usbcdcboot_wazamonotachi